//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2012, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************

//**********************************************************************
// $Header: /Alaska/SOURCE/Modules/SharkBayRefCodes/ISCT/IsctAcpiTables/Isct.uni 1     9/02/12 11:18p Bensonlai $
//
// $Revision: 1 $
//
// $Date: 9/02/12 11:18p $
//**********************************************************************
// Revision History
// ----------------
// $Log: /Alaska/SOURCE/Modules/SharkBayRefCodes/ISCT/IsctAcpiTables/Isct.uni $
//
// 1     9/02/12 11:18p Bensonlai
// Intel Smart Connect Technology initially releases.
//
//
//**********************************************************************
//<AMI_FHDR_START>
//
// Name:  Isct.uni
//
// Description:	Define string for Isct
//
//<AMI_FHDR_END>
//**********************************************************************

/=#
#include "VFR.uni"

//---------------------------------------------------------------------------
// Isct Configuration
//---------------------------------------------------------------------------

#string STR_ENABLED                             #language eng "Enabled"
#string STR_DISABLED                            #language eng "Disabled"

#string STR_ISCTCONFIGURATION_FORM              #language eng "Intel(R) Smart Connect Technology"
#string STR_ISCTCONFIGURATION_HELP              #language eng "Intel(R) Smart Connect Technology Settings"

#string STR_ISCT_CONFIGURATION_PROMPT           #language eng "ISCT Support"
#string STR_ISCT_CONFIGURATION_HELP             #language eng "Enable/Disable ISCT Support"

#string STR_ISCT_NOTIFICATION_PROMPT            #language eng "ISCT Notification Control"
#string STR_ISCT_NOTIFICATION_HELP              #language eng "Enable/Disable ISCT Notification Control"

#string STR_ISCT_WLAN_PROMPT                    #language eng "ISCT WLAN Power Control"
#string STR_ISCT_WLAN_HELP                      #language eng "Enable/Disable ISCT WLAN Power Control"

#string STR_ISCT_WWAN_PROMPT                    #language eng "ISCT WWAN Power Control"
#string STR_ISCT_WWAN_HELP                      #language eng "Enable/Disable ISCT WWAN Power Control"

#string STR_ISCT_RF_KILL_SWITCH_PROMPT          #language eng "ISCT RF Kill Switch Type"
#string STR_ISCT_RF_KILL_SWITCH_HELP            #language eng "Software/Hardware ISCT RF Kill Switch Type"
#string STR_ISCT_SOFTWARE                       #language eng "Software"
#string STR_ISCT_HARDWARE                       #language eng "Hardware"

#string STR_ISCT_TIMER_SELECTION_PROMPT         #language eng "ISCT Timer Selection"
#string STR_ISCT_TIMER_SELECTION_HELP           #language eng "EC Timer/RTC Timer ISCT Timer Selection"
#string STR_ISCT_EC_TIMER                       #language eng "EC Timer"
#string STR_ISCT_RTC_TIMER                      #language eng "RTC Timer"

#string STR_ISCT_SLEEPFORMAT_PROMPT             #language eng "ISCT Sleep Duration Value Format"
#string STR_ISCT_SLEEPFORMAT_HELP               #language eng "Select Actual Time Or Duration In Seconds"
#string STR_ISCT_ACTUAL_TIME                    #language eng "Actual Time"
#string STR_ISCT_DURATION_IN_SECONDS            #language eng "Duration In Seconds"

//#string <string name>                   #language eng ""
//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2012, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************
